robert-hh/micropython/ports/mimxrt/machine_sdcard.c
STATIC mimxrt_sdcard_obj_t mimxrt_sdcard_objs[1] = {
    {
        .base.type = &machine_sdcard_type,
        .sdcard = USDHC1,
        .rca = 0x0UL,
    }
};

STATIC const mp_arg_t allowed_args[] = {
    [SDCARD_INIT_ARG_ID]     { MP_QSTR_id, MP_ARG_INT, {.u_int = 0} },
};


static void sdcard_check_status(status_t status, uint8_t command) {
    if (status != kStatus_Success) {
        mp_printf(&mp_plat_print, "Command %d failed!", command);
        switch (status)
        {
            case (kStatus_USDHC_BusyTransferring): {
                mp_printf(&mp_plat_print, " - BusyTransferring (%d)\n", status);
                break;
            }
            case (kStatus_USDHC_PrepareAdmaDescriptorFailed): {
                mp_printf(&mp_plat_print, " - PrepareAdmaDescriptorFailed (%d)\n", status);
                break;
            }
            case (kStatus_USDHC_SendCommandFailed): {
                mp_printf(&mp_plat_print, " - SendCommandFailed (%d)\n", status);
                break;
            }
            case (kStatus_USDHC_TransferDataFailed): {
                mp_printf(&mp_plat_print, " - TransferDataFailed (%d)\n", status);
                break;
            }
            case (kStatus_USDHC_DMADataAddrNotAlign): {
                mp_printf(&mp_plat_print, " - DMADataAddrNotAlign (%d)\n", status);
                break;
            }
            case (kStatus_USDHC_ReTuningRequest): {
                mp_printf(&mp_plat_print, " - ReTuningRequest (%d)\n", status);
                break;
            }
            case (kStatus_USDHC_TuningError): {
                mp_printf(&mp_plat_print, " - TuningError (%d)\n", status);
                break;
            }
            case (kStatus_USDHC_NotSupport): {
                mp_printf(&mp_plat_print, " - NotSupport (%d)\n", status);
                break;
            }
            default: {
                mp_printf(&mp_plat_print, " - Unknown\n");
                break;
            }
        }
    }
}

static void sdcard_cmd_go_idle_state(USDHC_Type *base) {
    status_t status;
    usdhc_command_t command = {
        .index = SdCmd_GoIdleState,
        .argument = 0UL,
        .type = kCARD_CommandTypeNormal,
        .responseType = kCARD_ResponseTypeNone,
    };
    usdhc_transfer_t transfer = {
        .data = NULL,
        .command = &command,
    };
    status = USDHC_TransferBlocking(base, NULL, &transfer);
    sdcard_check_status(status, SdCmd_GoIdleState);
}

static uint32_t sdcard_cmd_oper_cond(USDHC_Type *base) {
    status_t status;
    usdhc_command_t command = {
        .index = SdCmd_SendIfCond,
        .argument = 0x000001AAU,       // 2.7-3.3V range and 0xAA check pattern
        .type = kCARD_CommandTypeNormal,
        .responseType = kCARD_ResponseTypeR7,
    };
    usdhc_transfer_t transfer = {
        .data = NULL,
        .command = &command,
    };

    status = USDHC_TransferBlocking(base, NULL, &transfer);
    sdcard_check_status(status, SdCmd_SendIfCond);
    return command.response[0];
}

static uint32_t sdcard_cmd_app_cmd(USDHC_Type *base) {
    status_t status;
    usdhc_command_t command = {
        .index = SdCmd_ApplicationCommand,
        .argument = 0UL,
        .type = kCARD_CommandTypeNormal,
        .responseType = kCARD_ResponseTypeR1,
    };
    usdhc_transfer_t transfer = {
        .data = NULL,
        .command = &command,
    };

    status = USDHC_TransferBlocking(base, NULL, &transfer);
    sdcard_check_status(status, SdCmd_ApplicationCommand);
    return command.response[0];
}

static uint32_t sdcard_cmd_sd_app_op_cond(USDHC_Type *base, uint32_t argument) {
    status_t status;
    usdhc_command_t command = {
        .index = SdAcmd_SendOpCond,
        .argument = argument,
        .type = kCARD_CommandTypeNormal,
        .responseType = kCARD_ResponseTypeR3,
    };

    usdhc_transfer_t transfer = {
        .data = NULL,
        .command = &command,
    };

    status = USDHC_TransferBlocking(base, NULL, &transfer);
    sdcard_check_status(status, SdAcmd_SendOpCond);
    return command.response[0];
}

static cid_t sdcard_cmd_all_send_cid(USDHC_Type *base) {
    status_t status;
    cid_t cid;
    usdhc_command_t command = {
        .index = SdCmd_AllSendCid,
        .argument = 0UL,
        .type = kCARD_CommandTypeNormal,
        .responseType = kCARD_ResponseTypeR2,
    };
    usdhc_transfer_t transfer = {
        .data = NULL,
        .command = &command,
    };

    status = USDHC_TransferBlocking(base, NULL, &transfer);
    sdcard_check_status(status, SdCmd_AllSendCid);
    // --
    cid.cid[0] = command.response[0];
    cid.cid[1] = command.response[1];
    cid.cid[2] = command.response[2];
    cid.cid[3] = command.response[3];
    // --
    return cid;
}

static cid_t sdcard_cmd_send_cid(USDHC_Type *base, uint32_t rca) {
    status_t status;
    cid_t cid;
    usdhc_command_t command = {
        .index = SdCmd_SendCid,
        .argument = (rca << 16),
        .type = kCARD_CommandTypeNormal,
        .responseType = kCARD_ResponseTypeR2,
    };
    usdhc_transfer_t transfer = {
        .data = NULL,
        .command = &command,
    };

    status = USDHC_TransferBlocking(base, NULL, &transfer);
    sdcard_check_status(status, SdCmd_SendCid);
    // --
    cid.cid[0] = command.response[0];
    cid.cid[1] = command.response[1];
    cid.cid[2] = command.response[2];
    cid.cid[3] = command.response[3];
    // --
    return cid;
}

static uint32_t sdcard_cmd_set_rel_add(USDHC_Type *base) {
    status_t status;
    usdhc_command_t command = {
        .index = SdCmd_SendRelAddr,
        .argument = 0UL,
        .type = kCARD_CommandTypeNormal,
        .responseType = kCARD_ResponseTypeR6,
    };
    usdhc_transfer_t transfer = {
        .data = NULL,
        .command = &command,
    };

    status = USDHC_TransferBlocking(base, NULL, &transfer);
    sdcard_check_status(status, SdCmd_SendRelAddr);
    return 0xFFFFFFFF & (command.response[0] >> 16);
}

static csd_t sdcard_cmd_send_csd(USDHC_Type *base, uint32_t rca) {
    status_t status;
    csd_t csd;
    usdhc_command_t command = {
        .index = SdCmd_SendCsd,
        .argument = (rca << 16),
        .type = kCARD_CommandTypeNormal,
        .responseType = kCARD_ResponseTypeR2,
    };
    usdhc_transfer_t transfer = {
        .data = NULL,
        .command = &command,
    };

    status = USDHC_TransferBlocking(base, NULL, &transfer);
    sdcard_check_status(status, SdCmd_SendCsd);
    // --
    csd.csd[0] = command.response[0];
    csd.csd[1] = command.response[1];
    csd.csd[2] = command.response[2];
    csd.csd[3] = command.response[3];
    // --
    return csd;
}

static void sdcard_transfer_command(USDHC_Type *base, usdhc_command_t *command) {
    status_t status;
    usdhc_transfer_t transfer = {
        .data = NULL,
        .command = command,
    };
    // ---
    status = USDHC_TransferBlocking(base, NULL, &transfer);

