robert-hh/micropython/ports/mimxrt/machine_sdcard.c
    if (status != kStatus_Success) {
        mp_printf(&mp_plat_print, "Command %d failed!", command->index);
        switch (status)
        {
            case (kStatus_USDHC_BusyTransferring): {
                mp_printf(&mp_plat_print, " - BusyTransferring (%d)\n", status);
                break;
            }
            case (kStatus_USDHC_PrepareAdmaDescriptorFailed): {
                mp_printf(&mp_plat_print, " - PrepareAdmaDescriptorFailed (%d)\n", status);
                break;
            }
            case (kStatus_USDHC_SendCommandFailed): {
                mp_printf(&mp_plat_print, " - SendCommandFailed (%d)\n", status);
                break;
            }
            case (kStatus_USDHC_TransferDataFailed): {
                mp_printf(&mp_plat_print, " - TransferDataFailed (%d)\n", status);
                break;
            }
            case (kStatus_USDHC_DMADataAddrNotAlign): {
                mp_printf(&mp_plat_print, " - DMADataAddrNotAlign (%d)\n", status);
                break;
            }
            case (kStatus_USDHC_ReTuningRequest): {
                mp_printf(&mp_plat_print, " - ReTuningRequest (%d)\n", status);
                break;
            }
            case (kStatus_USDHC_TuningError): {
                mp_printf(&mp_plat_print, " - TuningError (%d)\n", status);
                break;
            }
            case (kStatus_USDHC_NotSupport): {
                mp_printf(&mp_plat_print, " - NotSupport (%d)\n", status);
                break;
            }
            default: {
                mp_printf(&mp_plat_print, " - Unknown\n");
                break;
            }
        }
    } else {
        mp_printf(&mp_plat_print, "Command %d succeeded!\n", command->index);

        switch (command->responseType)
        {
            case (kCARD_ResponseTypeR1): {
                mp_printf(&mp_plat_print, "\t0x%08X - Card Status\n", command->response[0]);
                break;
            }
            case (kCARD_ResponseTypeR1b): {
                mp_printf(&mp_plat_print, "\t0x%08X - Card Status for Auto CMD12\n", command->response[3]);
                break;
            }

            case (kCARD_ResponseTypeR2): {
                mp_printf(&mp_plat_print, "\tCID/CSD\n");
                mp_printf(&mp_plat_print, "\t0x%08X\n", command->response[0]);
                mp_printf(&mp_plat_print, "\t0x%08X\n", command->response[1]);
                mp_printf(&mp_plat_print, "\t0x%08X\n", command->response[2]);
                mp_printf(&mp_plat_print, "\t0x%08X\n", command->response[3]);
                break;

            }
            case (kCARD_ResponseTypeR3): {
                mp_printf(&mp_plat_print, "\t0x%08X - OCR\n", command->response[0]);
                break;
            }
            default: {
                // do nothing;
                break;
            }
        }
    }
}



static status_t sdcard_read(USDHC_Type *base, uint8_t *buffer, uint32_t start_block, size_t block_size, uint32_t block_count) {

    // Todo: check card busy

    // Todo: check/read different behaviour for cards with high capacity for block_size checks !!

    usdhc_handle_t handle;


    usdhc_data_t data = {
        .enableAutoCommand12 = true,
        .enableAutoCommand23 = false,
        .enableIgnoreError = false,
        .dataType = kUSDHC_TransferDataNormal,
        .blockSize = block_size,
        .blockCount = block_count,
        .rxData = (uint32_t *)buffer,
        .txData = NULL,
    };

    usdhc_command_t command = {
        .index = (block_count == 1U) ? (uint32_t)SdCmd_ReadSingleBlock : (uint32_t)SdCmd_ReadMultipleBlock,
        .argument = start_block,
        .type = kCARD_CommandTypeNormal,
        .responseType = kCARD_ResponseTypeR1,
        .responseErrorFlags = SDMMC_R1_ALL_ERROR_FLAG,
    };

    usdhc_transfer_t transfer = {
        .data = &data,
        .command = &command,
    };

    usdhc_adma_config_t dmaConfig = {
        .dmaMode = kUSDHC_DmaModeAdma2,
        #if !(defined(FSL_FEATURE_USDHC_HAS_NO_RW_BURST_LEN) && FSL_FEATURE_USDHC_HAS_NO_RW_BURST_LEN)
        .burstLen = kUSDHC_EnBurstLenForINCR,
        #endif
        .admaTable = s_sdmmcHostDmaBuffer,
        .admaTableWords = BOARD_SDMMC_HOST_DMA_DESCRIPTOR_BUFFER_SIZE,
    };


    DCACHE_CleanByRange((uint32_t)data.rxData, (data.blockSize * data.blockCount));
    return USDHC_TransferNonBlocking(base, &handle, &dmaConfig, &transfer);
}




// static status_t SD_Write(sd_card_t *card,
//                          const uint8_t *buffer,
//                          uint32_t startBlock,
//                          uint32_t blockSize,
//                          uint32_t blockCount,
//                          uint32_t *writtenBlocks)
// {
//     assert(card != NULL);
//     assert(buffer != NULL);
//     assert(blockCount != 0U);
//     assert(blockSize == FSL_SDMMC_DEFAULT_BLOCK_SIZE);

//     sdmmchost_transfer_t content = {0};
//     sdmmchost_cmd_t command      = {0};
//     sdmmchost_data_t data        = {0};
//     status_t error;

//     if ((((card->flags & (uint32_t)kSD_SupportHighCapacityFlag) != 0U) && (blockSize != 512U)) ||
//         (blockSize > card->blockSize) || (blockSize > SDMMCHOST_SUPPORT_MAX_BLOCK_LENGTH) || ((blockSize % 4U) != 0U))
//     {
//         SDMMC_LOG("\r\nError: write with parameter, block size %d is not support", blockSize);
//         return kStatus_SDMMC_CardNotSupport;
//     }

//     /* check card status for not busy*/
//     if (kStatus_Success != SD_PollingCardStatusBusy(card, false, SD_CARD_ACCESS_WAIT_IDLE_TIMEOUT))
//     {
//         return kStatus_SDMMC_WaitWriteCompleteFailed;
//     }

//     data.enableAutoCommand12   = true;
//     data.blockSize             = blockSize;
//     command.responseType       = kCARD_ResponseTypeR1;
//     command.responseErrorFlags = SDMMC_R1_ALL_ERROR_FLAG;

//     command.index    = (blockCount == 1U) ? (uint32_t)kSDMMC_WriteSingleBlock : (uint32_t)kSDMMC_WriteMultipleBlock;
//     command.argument = startBlock;
//     if (0U == (card->flags & (uint32_t)kSD_SupportHighCapacityFlag))
//     {
//         command.argument *= data.blockSize;
//     }

//     *writtenBlocks  = blockCount;
//     data.blockCount = blockCount;
//     data.txData     = (const uint32_t *)(uint32_t)buffer;

//     content.command = &command;
//     content.data    = &data;

//     error = SD_Transfer(card, &content, 3U);
//     if (error != kStatus_Success)
//     {
//         error = SD_SendWriteSuccessBlocks(card, writtenBlocks);
//         /* check the successfully written block */
//         if (error == kStatus_Success)
//         {
//             if (*writtenBlocks != 0U)
//             {
//                 /* written success, but not all the blocks are written */
//                 error = kStatus_Success;
//             }
//         }
//         SDMMC_LOG("\r\nWarning: write failed with block count %d, successed %d", blockCount, *writtenBlocks);
//     }

